[View in Colaboratory](https://colab.research.google.com/github/praveenkanumarlapudi/SQL-Playground/blob/master/FIRST_VALUE_and_LAST_VALUE.ipynb)

**FIRST_VALUE** :
FIRST_VALUE is used to retrive first value from the partioned group.

**Syntax:**

  FIRST_VALUE
  (expr) [{RESPECT | IGNORE} NULLS]
  |
  (expr) [{RESPECT | IGNORE} NULLS]

In [0]:
SELECT empno,
       deptno,
       sal,
       FIRST_VALUE(sal) IGNORE NULLS 
         OVER (PARTITION BY deptno ORDER BY sal) AS lowest_in_dept
FROM   emp;

     EMPNO     DEPTNO        SAL LOWEST_IN_DEPT
---------- ---------- ---------- --------------
      7934         10       1300           1300
      7782         10       2450           1300
      7839         10       5000           1300
      7369         20        800            800
      7876         20       1100            800
      7566         20       2975            800
      7788         20       3000            800
      7902         20       3000            800
      7900         30        950            950
      7654         30       1250            950
      7521         30       1250            950
      7844         30       1500            950
      7499         30       1600            950
      7698         30       2850            950

Find Preeceding Lowest Salary in the Department

In [0]:
SELECT EMPNO, DEPTNO, SAL, FIRST_VALUE(SAL IGNORE NULLS)
                           OVER (PARTITION BY DEPTNO ORDER BY SAL ROWs 1 PRECEDING) previous_lower
                           FROM EMP

In [0]:
EMPNO	DEPTNO	SAL	PREVIOUS_LOWER
7934	10	1300	1300
7782	10	2450	1300
7839	10	5000	2450
7369	20	800	800
7876	20	1100	800
7566	20	2975	1100
7788	20	3000	2975
7902	20	3000	3000
7900	30	950	950
7654	30	1250	950
7521	30	1250	1250
7844	30	1500	1250
7499	30	1600	1500
7698	30	2850	1600

**LAST_VALUE:**

The LAST_VALUE analytic function is similar to the LAST analytic function, allowing you to return the last result from an ordered set. Using the default windowing clause the result can be a little unexpected.


**Syntax :**

LAST_VALUE(expr) [{RESPECT | IGNORE}] NULLS

In [0]:
SELECT EMPNO, DEPTNO, SAL, LAST_VALUE(SAL IGNORE NULLS)
               OVER (PARTITION BY DEPTNO ORDER BY SAL ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) HIGHEST_SAL
               FROM EMP;

In [0]:
EMPNO	DEPTNO	SAL	HIGHEST_SAL
7934	10	1300	5000
7782	10	2450	5000
7839	10	5000	5000
7369	20	800	3000
7876	20	1100	3000
7566	20	2975	3000
7788	20	3000	3000
7902	20	3000	3000
7900	30	950	2850
7654	30	1250	2850
7521	30	1250	2850
7844	30	1500	2850
7499	30	1600	2850
7698	30	2850	2850